In [3]:
import pandas as pd
import numpy as np
data = {
    'Name': ['Ramesh', 'Mahesh', 'Suresh'],
    'Age': [25, 30, 35],
    'City': ['Bangalore', 'Mumbai', 'Delhi']
}
df=pd.DataFrame(data)
df
# df.head(2)
# df['Age']
# df.loc[df['Age'] > 26]
# df['Country'] = "India"
# data1 = {
#     'Name': ['Ramesh', 'Mahesh', 'Suresh'],
#     'Age': [25, None , 35],
#     'City': ['Bangalore', 'Mumbai', 'Delhi']
# }
# df2= pd.DataFrame(data1)
# meanAge = np.mean(df2['Age'])
# for i in range(3):
#     if (str(df2['Age'][i]) == 'nan'):
#         df2['Age'][i] = meanAge
# df2['Age'] = df2['Age'].fillna(0)
# for i in range(3):
#     if (df2['Age'][i] == 0):
#         df2['Age'][i] = meanAge
# df2['Age']=df2['Age'].fillna(meanAge)
# df2

     Name  Age       City
0  Ramesh   25  Bangalore
1  Mahesh   30     Mumbai
2  Suresh   35      Delhi

In [4]:
df.head(2)

     Name  Age       City
0  Ramesh   25  Bangalore
1  Mahesh   30     Mumbai

In [5]:
df['Age']

0    25
1    30
2    35
Name: Age, dtype: int64

In [6]:
df.loc[df['Age'] > 26]

     Name  Age    City
1  Mahesh   30  Mumbai
2  Suresh   35   Delhi

In [8]:
df['Country'] = "India"
df

     Name  Age       City Country
0  Ramesh   25  Bangalore   India
1  Mahesh   30     Mumbai   India
2  Suresh   35      Delhi   India

In [10]:
data1 = {
    'Name': ['Ramesh', 'Mahesh', 'Suresh'],
    'Age': [25, None , 35],
    'City': ['Bangalore', 'Mumbai', 'Delhi']
}
df2= pd.DataFrame(data1)
df2

     Name   Age       City
0  Ramesh  25.0  Bangalore
1  Mahesh   NaN     Mumbai
2  Suresh  35.0      Delhi

In [12]:
meanAge = np.mean(df2['Age'])
# for i in range(3):
#     if (str(df2['Age'][i]) == 'nan'):
#         df2['Age'][i] = meanAge
# df2['Age'] = df2['Age'].fillna(0)
# for i in range(3):
#     if (df2['Age'][i] == 0):
#         df2['Age'][i] = meanAge
df2['Age']=df2['Age'].fillna(meanAge)
df2

     Name   Age       City
0  Ramesh  25.0  Bangalore
1  Mahesh  30.0     Mumbai
2  Suresh  35.0      Delhi